"""
zip([iterable, ...])：用于将可迭代的对象作为参数，将对象中对应的元素打包成一个个元组，然后返回由这些元组组成的对象，这样做的好处是节约了不少的内存。

我们可以使用 list() 转换来输出列表。
如果各个迭代器的元素个数不一致，则返回列表长度与最短的对象相同，利用 * 号操作符，可以将元组解压为列表。
"""

a = [1, 2, 3, 4, 'aaaa']
b = [5, 6, 7, 8]

zipped = zip(a, b)
print(zipped)
print(list(zipped))

print("------------------------------------------------------")

print(*zip(a, b))

print("------------------------------------------------------")

a1, a2 = zip(*zip(a, b))  # 解压
print(a1)
print(a2)

print("------------------------------------------------------")

dict1 = dict(zip(a, b))
print(dict1)
