print('----------------------------------------')

ajf = '你' "好" """啊"""
print(ajf)

print('----------------------------------------')

str1 = '     "我淦"     '  # 可以包含""
str2 = '''     '你妹' 和 "尴尬" 和 """ 吗"""      '''  # 可以包含''和""
str3 = """    '你' 和 "怎么办" 和 '''啊'''    """  # 可以包含''和""和''' '''
print(str1)
print(str2)
print(str3)

print("-------------------- 字符串索引 --------------------")
"""
字符串：abcdef
         a   b   c   d   e   f
前索引： 0、 1、 2、 3、 4、 5
后索引：-6、-5、-4、-3、-2、-1
"""
str = '123456789'
print(str)  # 输出字符串
print(str[0])  # 输出索引为1的字符
print(str[-1])  # 输出索引为-1的字符
print(str[0:-1])  # 输出索引0到-1的字符
print(str[2:5])  # 输出从第三个开始到第五个的字符
print(str[2:])  # 输出从第三个开始后的所有字符
print(str[1:5:2])  # 输出从第二个开始到第五个且每隔一个的字符（步长为2）
print(str * 2)  # 输出字符串两次
print(str + '你好')  # 连接字符串
print('\n')  # 输出空行，函数之间或类的方法之间用空行分隔，表示一段新的代码的开始。

print("-------------------- r'', b'', u'', f'' --------------------")

print(r'input\\n')  # 表示非转义原生字符
print(b'input\\n')  # bytes字节符
print(br'input\\n')  # 组合使用

print(u'input\\n')  # 表示unicode字符串
print(f'%s' % 'a')  # 格式化操作

print("-------------------- 逻辑运算 --------------------")
print('a' and 'b')
print('a' or 'b')
print('' or 'b')

print("-------------------- 内存分配 --------------------")

str1 = 'abc'
str2 = 'abc'

print('str1：{}'.format(id(str1)))
print('str2：{}'.format(id(str2)))
